import 'package:places/domain/sight.dart';

final List<Sight> mocks = [
  Sight(
    name: 'Дудергофские высоты',
    lat: 59.6973805,
    lon: 30.1291935,
    url: 'https://goo.gl/maps/8MqGMvGmLsZTSKjR8',
    details:
        'Памятник природы, группа холмов ледникового происхождения, одна часть которых расположена в Ломоносовском районе Ленинградской области, а другая на юго-западе Санкт-Петербурга.',
    type: 'Парк',
  ),
  Sight(
    name: 'Линдуловская роща',
    lat: 60.2302584,
    lon: 29.5068099,
    url: 'https://goo.gl/maps/NFLNviJ6fMVge4QE7',
    details:
        'Государственный природный ботанический заказник. Расположен на территории Выборгского района Ленинградской области вблизи посёлка Рощино.',
    type: 'Парк',
  ),
  Sight(
    name: 'Пулковская обсерватория',
    lat: 59.7722654,
    lon: 30.3239842,
    url: 'https://goo.gl/maps/xHSusNX6yhJnHsRK6',
    details:
        'Основная астрономическая обсерватория Российской академии наук. Открыта 7 августа 1839 года. Располагается в 19 км к югу от центра Санкт-Петербурга на местности Пулково на Пулковских высотах.',
    type: 'Музей',
  ),
  Sight(
    name: 'Нарвские триумфальные ворота',
    lat: 59.900942,
    lon: 30.2716213,
    url: 'https://goo.gl/maps/DuxL79pziduWbPDf8',
    details:
        'На́рвские триумфа́льные воро́та — памятник архитектуры стиля ампир в Санкт-Петербурге. Расположен на площади Стачек вблизи станции метро «Нарвская».',
    type: 'Памятник',
  ),
  Sight(
    name: 'Эрмитаж',
    lat: 59.9398479,
    lon: 30.3132962,
    url: 'https://goo.gl/maps/6De6mxabV5FDkC3n7',
    details:
        'Музей изобразительного и декоративно-прикладного искусства, расположенный в городе Санкт-Петербурге Российской Федерации. Основан 7 декабря 1764 года. Является одним из крупнейших художественных музеев в мире.',
    type: 'Музей',
  ),
  Sight(
    name: 'Московский парк Победы',
    lat: 59.8684463,
    lon: 30.3265808,
    url: 'https://goo.gl/maps/BaJK2cADwJCcyKZc9',
    details:
        'Парк в Московском районе Санкт-Петербурга. Впервые заложен в 1939—1941 годах в соответствии с Генеральным планом развития Ленинграда как Парк культуры и отдыха.',
    type: 'Парк',
  ),
  Sight(
    name: 'Площадь Победы',
    lat: 59.8430874,
    lon: 30.3181712,
    url: 'https://goo.gl/maps/xHeqhAC49LT7fC4a9',
    details: 'Площадь в Московском районе Санкт-Петербурга.',
    type: 'Памятник',
  ),
];
